public/uploads/atlas/sample/atlasSampleOrderXml.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ord="http://1800flowers.com/BTOP/OrderFile">
    <soapenv:Header/>
    <soapenv:Body>
        <ord:orderFile>
            <ord:orders>
                <ord:orderHeader>
                    <ord:primaryBrand>1001</ord:primaryBrand>
                    <ord:orderNumber>ordernumber</ord:orderNumber>
                    <ord:externalOrderNumber></ord:externalOrderNumber>
                    <ord:externalTransId></ord:externalTransId>
                    <ord:machineId></ord:machineId>
                    <ord:orderDate>orderdate</ord:orderDate>
                    <ord:thirdPartyToken>
                        <ord:tokenId></ord:tokenId>
                        <ord:tokenType>PHOTOLABEL</ord:tokenType>
                        <ord:tokenDetails1></ord:tokenDetails1>
                        <ord:tokenDetails2></ord:tokenDetails2>
                    </ord:thirdPartyToken>
                    <ord:soldTo>
                        <ord:cifId></ord:cifId>
                        <ord:houseAccountNumber>soldto_houseaccountnumber</ord:houseAccountNumber>
                        <ord:title></ord:title>
                        <ord:firstName>soldto_firstname</ord:firstName>
                        <ord:lastName>soldto_lastname</ord:lastName>
                        <!--Optional:-->
                        <ord:address>
                            <ord:streetAddress1>soldto_address_streetaddress1_</ord:streetAddress1>
                            <ord:streetAddress2>soldto_address_streetaddress2_</ord:streetAddress2>
                            <ord:streetAddress3></ord:streetAddress3>
                            <ord:attentionText>NA</ord:attentionText>
                            <ord:cityName>soldto_city_</ord:cityName>
                            <ord:state>soldto_state_</ord:state>
                            <ord:zipCode>soldto_zipcode_</ord:zipCode>
                            <ord:countryCode>soldto_countrycode</ord:countryCode>
                            <ord:addressType>0</ord:addressType>
                        </ord:address>
                        <!--Optional:-->
                        <ord:phones>
                            <ord:type>HP</ord:type>
                            <ord:telephoneNumber>soldto_telephonenumber</ord:telephoneNumber>
                        </ord:phones>
                        <ord:emailAddress>soldto_emailaddress</ord:emailAddress>
                        <ord:optInFlag></ord:optInFlag>
                        <ord:gender>N</ord:gender>
                        <ord:specialFlag></ord:specialFlag>
                        <ord:businessName>soldto_businessname</ord:businessName>
                        <ord:middleName></ord:middleName>
                        <ord:suffix></ord:suffix>
                        <ord:CustomerSuffix></ord:CustomerSuffix>
                    </ord:soldTo>
                    <ord:orderTotalAmount>
                        <ord:totalAmount>order_totalamount</ord:totalAmount>
                        <ord:taxAmount>tax_amount</ord:taxAmount>
                        <ord:discountAmount>order_toataldiscount</ord:discountAmount>
                        <ord:serviceCharge>service_charge_amount</ord:serviceCharge>
                        <ord:giftCertificateAmount></ord:giftCertificateAmount>
                        <ord:shippingChargeAmount>0.00</ord:shippingChargeAmount>
                    </ord:orderTotalAmount>
                    <ord:serverId></ord:serverId>
                    <ord:sourceId>sourceid</ord:sourceId>
                    <ord:sourceCode>NA</ord:sourceCode>
                    <ord:sourceTypeCode></ord:sourceTypeCode>
                    <ord:companyCode>046</ord:companyCode>
                    <ord:merchantId>126367</ord:merchantId>
                    <ord:partnerId></ord:partnerId>
                    <ord:linkshareDetails>
                        <ord:linkshareId></ord:linkshareId>
                        <ord:orderStartTime></ord:orderStartTime>
                        <ord:orderCompleteTime></ord:orderCompleteTime>
                    </ord:linkshareDetails>
                    <ord:agentInfo>
                        <ord:employeeCode></ord:employeeCode>
                        <ord:sourceCode>NA</ord:sourceCode>
                        <ord:telecenterCode></ord:telecenterCode>
                    </ord:agentInfo>
                    <ord:transactionReleaseCode></ord:transactionReleaseCode>
                    <ord:findersFileNumber></ord:findersFileNumber>
                    <ord:DNIS></ord:DNIS>
                    <ord:caller></ord:caller>
                    <ord:ANI></ord:ANI>
                    <ord:IPAddress>ipaddress</ord:IPAddress>
                    <ord:ReleaseDescription></ord:ReleaseDescription>
                    <ord:channelId></ord:channelId>
                    <ord:orderNotes></ord:orderNotes>
                    <ord:orderCaptureClientId></ord:orderCaptureClientId>
                    <ord:bannerCode></ord:bannerCode>
                    <ord:referralCode></ord:referralCode>
                    <ord:cmTrackInfo1></ord:cmTrackInfo1>
                    <ord:cmTrackInfo2></ord:cmTrackInfo2>
                    <ord:agentId></ord:agentId>
                    <ord:startTime></ord:startTime>
                    <ord:endTime></ord:endTime>
                    <ord:finderNumber></ord:finderNumber>
                    <ord:customerInterface></ord:customerInterface>
                    <ord:refererUrl></ord:refererUrl>
                    <ord:landingUrl></ord:landingUrl>
                    <ord:userAgent></ord:userAgent>
                    <ord:shopperSatus></ord:shopperSatus>
                    <ord:passportUsed></ord:passportUsed>
                    <ord:passportStatus></ord:passportStatus>
                    <ord:signedApp></ord:signedApp>
                    <ord:giftListUsed></ord:giftListUsed>
                    <ord:promoStatus></ord:promoStatus>
                    <ord:checkoutBrand></ord:checkoutBrand>
                </ord:orderHeader>
                <ord:orderDetails>
                    <ord:brandCode>orderdetails_brandcode</ord:brandCode>
                    <!--Order Product Line Item-->
                    products_data
                    <!--End Order Product Line Item-->
                    <ord:brandTotalAmount>
                        <ord:totalAmount>orderdetails_brandtotalamount_totalamount</ord:totalAmount>
                        <ord:taxAmount>orderdetails_brandtotalamount_taxamount</ord:taxAmount>
                        <ord:discountAmount>orderdetails_brandtotalamount_discountamount</ord:discountAmount>
                        <ord:serviceCharge>orderdetails_recipienttotalamount_servicecharge</ord:serviceCharge>
                        <ord:giftCertificateAmount></ord:giftCertificateAmount>
                        <ord:shippingChargeAmount>orderdetails_brandtotalamount_shippingchargeamount</ord:shippingChargeAmount>
                    </ord:brandTotalAmount>
                    <ord:paymentDetails>
                        <ord:creditCardPayment>
                            <ord:creditCardNumber>pd_credit_card_number</ord:creditCardNumber>
                            <ord:nameOnCard>pd_name_on_card</ord:nameOnCard>
                            <ord:billToInfo>
                                <ord:cifId></ord:cifId>
                                <ord:title></ord:title>
                                <ord:firstName>bti_first_name</ord:firstName>
                                <ord:lastName>bti_last_name</ord:lastName>
                                <ord:address>
                                    <ord:streetAddress1>billtoinfo_address1</ord:streetAddress1>
                                    <ord:streetAddress2>billtoinfo_address2</ord:streetAddress2>
                                    <ord:streetAddress3></ord:streetAddress3>
                                    <ord:attentionText></ord:attentionText>
                                    <ord:cityName>billtoinfo_cityname</ord:cityName>
                                    <ord:state>billtoinfo_state</ord:state>
                                    <ord:zipCode>billtoinfo_zipcode</ord:zipCode>
                                    <ord:countryCode>orderdetails_billing_countrycode</ord:countryCode>
                                    <ord:addressType>1</ord:addressType>
                                </ord:address>
                                <ord:phones>
                                    <ord:type>HP</ord:type>
                                    <ord:telephoneNumber>billtoinfo_telephoneNumber</ord:telephoneNumber>
                                </ord:phones>
                                <ord:emailAddress>billtoinfo_emailaddress</ord:emailAddress>
                                <ord:optInFlag></ord:optInFlag>
                                <ord:gender>N</ord:gender>
                                <ord:specialFlag></ord:specialFlag>
                                <ord:businessName></ord:businessName>
                                <ord:middleName></ord:middleName>
                                <ord:suffix></ord:suffix>
                                <ord:CustomerSuffix></ord:CustomerSuffix>
                            </ord:billToInfo>
                            <ord:expirationDate>cc_expiration_date</ord:expirationDate>
                            <ord:cardType>card_type</ord:cardType>
                            <ord:thirdPartyPaymentType></ord:thirdPartyPaymentType>
                            <ord:thirdPartyTransactionId></ord:thirdPartyTransactionId>
                            <ord:approvalCode>approval_code</ord:approvalCode>
                            <ord:secureIdentifier>NA</ord:secureIdentifier>
                            <ord:CAVVValue>NA</ord:CAVVValue>
                            <ord:AVSResponseCode>NA</ord:AVSResponseCode>
                            <ord:currencyValue>NA</ord:currencyValue>
                            <ord:IPAddress>ipaddress</ord:IPAddress>
                            <ord:transactionXid></ord:transactionXid>
                            <ord:cardSecurityValue>NA</ord:cardSecurityValue>
                            <ord:CAVVResponseCode>NA</ord:CAVVResponseCode>
                            <ord:cardSecurityValueResponse>NA</ord:cardSecurityValueResponse>
                            <ord:authType>ccp_auth_type</ord:authType>
                            <ord:authorizedAmount>ccp_authorized_amount</ord:authorizedAmount>
                            <ord:googleTransactionId></ord:googleTransactionId>
                        </ord:creditCardPayment>
                        <ord:houseAccountPayment>
                            <ord:accountNumber>house_account_payment</ord:accountNumber>
                            <ord:referenceCode></ord:referenceCode>
                            <ord:costCenterCode></ord:costCenterCode>
                            <ord:poNumber></ord:poNumber>
                            <ord:paymentAmount>orderdetails_paymentdetails_houseaccountpayment_paymentamount</ord:paymentAmount>
                        </ord:houseAccountPayment>
                        <ord:BMLPayment>
                            <ord:bmlAccountNumber></ord:bmlAccountNumber>
                            <ord:dateOfBirth></ord:dateOfBirth>
                            <ord:socialSecurityNumber></ord:socialSecurityNumber>
                            <ord:termsAndConditionVersion></ord:termsAndConditionVersion>
                            <ord:itemCategory></ord:itemCategory>
                            <ord:additionalInfo></ord:additionalInfo>
                            <ord:registrationDate></ord:registrationDate>
                            <ord:productDeliveryType></ord:productDeliveryType>
                            <ord:authorizedAmount></ord:authorizedAmount>
                            <ord:authType></ord:authType>
                        </ord:BMLPayment>
                        <ord:funbuckPayment>
                            <ord:employeeId></ord:employeeId>
                            <ord:noOfFunbucks></ord:noOfFunbucks>
                        </ord:funbuckPayment>
                        <ord:payPalPayment>
                            <ord:transactionId></ord:transactionId>
                            <ord:settlementDate></ord:settlementDate>
                            <ord:settlementAmount></ord:settlementAmount>
                        </ord:payPalPayment>
                        <ord:vme>
                            <ord:callid></ord:callid>
                            <ord:adminId></ord:adminId>
                            <ord:transactionId></ord:transactionId>
                            <ord:settlementDate></ord:settlementDate>
                            <ord:settlementAmount></ord:settlementAmount>
                        </ord:vme>
                        <ord:giftCardPayments>
                            <!--Zero or more repetitions:-->
                            <ord:giftCardPayment>
                                <ord:giftCardApprovalCode>0</ord:giftCardApprovalCode>
                                <ord:giftCardAmount>0.00</ord:giftCardAmount>
                                <ord:giftCardNumber>0</ord:giftCardNumber>
                            </ord:giftCardPayment>
                        </ord:giftCardPayments>
                    </ord:paymentDetails>
                    <ord:promotions>
                        <!--Zero or more repetitions:-->
                        <ord:promotion>
                            <ord:promotionCode></ord:promotionCode>
                            <ord:promotionMemberId></ord:promotionMemberId>
                            <ord:promotionDiscountAmount></ord:promotionDiscountAmount>
                            <ord:promotionDiscountPercent></ord:promotionDiscountPercent>
                        </ord:promotion>
                    </ord:promotions>
                    <ord:basketThirdPartyInfo>
                        <ord:third_party_name></ord:third_party_name>
                        <ord:third_party_clubId></ord:third_party_clubId>
                        <ord:third_party_memberId></ord:third_party_memberId>
                    </ord:basketThirdPartyInfo>
                </ord:orderDetails>
                <ord:errorFlag></ord:errorFlag>
            </ord:orders>
        </ord:orderFile>
    </soapenv:Body>
</soapenv:Envelope>
